https://github.com/okovtun/BU_211.git
https://www.youtube.com/watch?v=UpM9unB1Pgs&list=PLeqyOOqxeiIOawl8qOYJiv1-8oEHXZvZy

TODO:
1. Напиать программу, в которую пользователь вводит число, и программа говорит,
   введенное число палиндром, или не палиндром.
   Палиндром - это число, которое читается одинаково, как слева направо, так и справа налево.
   12321 - палиндром
   12345 - обычное число
2. Пользователь вводит номербилета, и программа должна сказать билет счастливый или обычный.
   Счастливым называется билет, у которого сумма трех старших разрядов == сумме трех младших разрядов.
   123456 - обычный билет
   123123 - счастливый билет
   124502 - счастливый билет
3. Написать программу Shooter, которая определяет по нажатой клавише, 
   какое действие совершил пользователь:
	w - вперед;
	s - назад;
	a - влево;
	d - вправо;
	space - прыжок
	enter - огонь
	escape - выход

DONE:
Повторить всю теорию.

DONE:
Написать программу "Калькулятор", в которую ползователь вводит выражение вида 2 + 3,
и программа выдает результат операции:
2 + 3 = 5

DONE:
1. Выучить теорию!!!!!!!!!!!!!!!!!!!!!
2. Решить следующие задачи без исползования компилятора, 
   в компиляторе их можно только проверить:

   //1)	DONE
   int i = 3;
   i = ++i + ++i;
   cout << i << endl;	//что будет выведено на экран

   //2) DONE
   int i = 3;
   i = ++i + 1 + ++i * 2;
   cout << i << endl;	//что будет выведено на экран

   //3)	DONE
   int i = 3;
   i = ++i + 1 + ++i *= 2;
   cout << i << endl;	//что будет выведено на экран

   //4) DONE
   int i = 3;
   i += ++i + 1 + ++i *= 2;
   cout << i << endl;	//что будет выведено на экран

   //5) DONE
   int i = 3;
   i *= ++i + 1 + ++i += 2;
   cout << i << endl;	//что будет выведено на экран


TOREAD:
https://cplusplus.com/doc/tutorial/constants/
https://github.com/okovtun/BU_211/blob/master/NumericSystems.pdf

TOWATCH:
https://www.youtube.com/watch?v=RcxvcLl1nAs&t=21s	Bin
https://www.youtube.com/watch?v=AkXHkwVCcRU&t=2s	Hex

DONE:
1. Выучить теорию!
2. Используя Escape-последовательности вывести в консоль стишок
   "В лесу родилась Ёлочка". Стишок должен быть выровнен по сережине окна консоли,
   и его куплеты дожны быть разделены пустой строкой;